In [1]:
pip install pandas

Requirement already satisfied: pandas in /home/ayesha/snap/jupyter/common/lib/python3.7/site-packages (1.2.2)
Requirement already satisfied: pytz>=2017.3 in /home/ayesha/snap/jupyter/common/lib/python3.7/site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /snap/jupyter/6/lib/python3.7/site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.16.5 in /home/ayesha/snap/jupyter/common/lib/python3.7/site-packages (from pandas) (1.19.4)
Requirement already satisfied: six>=1.5 in /snap/jupyter/6/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.12.0)
WARNING: You are using pip version 20.3.3; however, version 21.0.1 is available.
You should consider upgrading via the '/snap/jupyter/6/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [15]:
obj=pd.Series([4,7,-5,3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [18]:
sales=pd.Series([100,200,100,400])
print(sales.values)
print(sales.index)

[100 200 100 400]
RangeIndex(start=0, stop=4, step=1)

In [21]:
sales=pd.Series([100,200,100,400],index=['a','b','c','d'])
print("Sales : ")
print(sales)
print("Sales Values: ")
print(sales.values)
print("Sales Index: ")
print(sales.index)

Sales :
a    100
b    200
c    100
d    400
dtype: int64
Sales Values:
[100 200 100 400]
Sales Index:
Index(['a', 'b', 'c', 'd'], dtype='object')

In [24]:
sales=pd.Series([100,200,100,400],index=['Jan','Feb','Mar','Apr'],name="4 Months Sale (Coloumn Header Name)")
print("Sales : ")
print(sales)
print("Sales Values: ")
print(sales.values)
print("Sales Index: ")
print(sales.index)

Sales :
Jan    100
Feb    200
Mar    100
Apr    400
Name: 4 Months Sale (Coloumn Header Name), dtype: int64
Sales Values:
[100 200 100 400]
Sales Index:
Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

# Canteen Record

In [5]:
sw=pd.Series([20,30,20,25,30,40,0],index=['Mon','Tue','Wed','Thurs','Fri','Sat','Sun'],name="Canteen Record")
print(sw)

Mon      20
Tue      30
Wed      20
Thurs    25
Fri      30
Sat      40
Sun       0
Name: Canteen Record, dtype: int64

In [7]:
print(sw[1])
print(sw["Tue"])

30
30

In [8]:
print(sw[[3,5]])

Thurs    25
Sat      40
Name: Canteen Record, dtype: int64

In [9]:
print(sw[["Tue","Wed"]])

Tue    30
Wed    20
Name: Canteen Record, dtype: int64

In [10]:
print(sw[sw>20])

Tue      30
Thurs    25
Fri      30
Sat      40
Name: Canteen Record, dtype: int64

In [11]:
a=sw*2
print(a)

Mon      40
Tue      60
Wed      40
Thurs    50
Fri      60
Sat      80
Sun       0
Name: Canteen Record, dtype: int64

In [12]:
b=sw/2
print(b)

Mon      10.0
Tue      15.0
Wed      10.0
Thurs    12.5
Fri      15.0
Sat      20.0
Sun       0.0
Name: Canteen Record, dtype: float64

In [14]:
'Mon' in sw

True

In [15]:
pip install numpy

Requirement already satisfied: numpy in /home/ayesha/snap/jupyter/common/lib/python3.7/site-packages (1.19.4)
WARNING: You are using pip version 20.3.3; however, version 21.0.1 is available.
You should consider upgrading via the '/snap/jupyter/6/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [16]:
import numpy as np

In [17]:
ar=np.array([3,2,4,5,6])
ind=np.array(['a','b','c','d','e'])
obj2=pd.Series(ar,index=ind)
print(obj2)

a    3
b    2
c    4
d    5
e    6
dtype: int64

In [21]:
sdata={"Sindh":35000,"Punjab":4500,"KPK":3000,"Balochistan":2000}
text_by_date=pd.Series(sdata,index=["Punjab","Sindh","KPK","Balochistan"])
print(text_by_date)
print(text_by_date.index)

Punjab          4500
Sindh          35000
KPK             3000
Balochistan     2000
dtype: int64
Index(['Punjab', 'Sindh', 'KPK', 'Balochistan'], dtype='object')

In [26]:
tax_by_date=pd.Series(sdata,index=["Punjab","Sindh","KPK","Balochistan","ETC"])
print(tax_by_date)
print(tax_by_date.index)
print(pd.isnull(tax_by_date))
tax_by_date.isnull()

Punjab          4500.0
Sindh          35000.0
KPK             3000.0
Balochistan     2000.0
ETC                NaN
dtype: float64
Index(['Punjab', 'Sindh', 'KPK', 'Balochistan', 'ETC'], dtype='object')
Punjab         False
Sindh          False
KPK            False
Balochistan    False
ETC             True
dtype: bool

Punjab         False
Sindh          False
KPK            False
Balochistan    False
ETC             True
dtype: bool

In [27]:
tax_by_date.name="state tax paying capacity"
tax_by_date.index.name="states name"
print(tax_by_date)
print(tax_by_date.index)

states name
Punjab          4500.0
Sindh          35000.0
KPK             3000.0
Balochistan     2000.0
ETC                NaN
Name: state tax paying capacity, dtype: float64
Index(['Punjab', 'Sindh', 'KPK', 'Balochistan', 'ETC'], dtype='object', name='states name')

# DataFrames

In [34]:
apples=pd.Series([3,2,0,1])
oranges=pd.Series([3,2,0,1])
print(apples)
print(oranges)
data={"apples":apples,"oranges":oranges}
fruits_df=pd.DataFrame(data,index=["mon","tue","wed","thurs"])
print(fruits_df)
print(fruits_df.index)

0    3
1    2
2    0
3    1
dtype: int64
0    3
1    2
2    0
3    1
dtype: int64
       apples  oranges
mon       NaN      NaN
tue       NaN      NaN
wed       NaN      NaN
thurs     NaN      NaN
Index(['mon', 'tue', 'wed', 'thurs'], dtype='object')

In [36]:
apples=pd.Series([3,2,0,1],index=["mon","tue","wed","thurs"])
oranges=pd.Series([3,2,0,1],index=["mon","tue","wed","thurs"])
print(apples)
print(oranges)
data={"apples":apples,"oranges":oranges}
fruits_df=pd.DataFrame(data)
print(fruits_df)
print(fruits_df.index)

mon      3
tue      2
wed      0
thurs    1
dtype: int64
mon      3
tue      2
wed      0
thurs    1
dtype: int64
       apples  oranges
mon         3        3
tue         2        2
wed         0        0
thurs       1        1
Index(['mon', 'tue', 'wed', 'thurs'], dtype='object')

In [38]:
state=['Ohio','Ohio','Nevada','Nevada','Japan','Japan']
data2={'state':state,
       'year':[2000,2001,2000,2001,2000,2001],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data2)
print(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2  Nevada  2000  3.6
3  Nevada  2001  2.4
4   Japan  2000  2.9
5   Japan  2001  3.2

In [39]:
state=['Ohio','Ohio','Nevada','Nevada','Japan','Japan']
data2={'state':state,
       'year':[2000,2001,2000,2001,2000,2001],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data2,index=['1st','2nd','3rd','4th','5th','6th'])
print(frame)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd  Nevada  2000  3.6
4th  Nevada  2001  2.4
5th   Japan  2000  2.9
6th   Japan  2001  3.2

In [61]:
frame.head()
#print(frame)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2000  Nevada  3.6
3  2001  Nevada  2.4
4  2000   Japan  2.9

In [43]:
frame=pd.DataFrame(data2, columns=['year','state','pop'])
frame.head()

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2000  Nevada  3.6
3  2001  Nevada  2.4
4  2000   Japan  2.9

In [48]:
frame2=pd.DataFrame(data2, columns=['year','state','pop','Debt'],
                   index=['one','two','three','four','five','six'])

frame2.head()

       year   state  pop Debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2000  Nevada  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2000   Japan  2.9  NaN

In [49]:
frame2.columns

Index(['year', 'state', 'pop', 'Debt'], dtype='object')

In [50]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [51]:
#disaligntation
data2['state']

['Ohio', 'Ohio', 'Nevada', 'Nevada', 'Japan', 'Japan']

In [52]:
#state like
frame2['year']

one      2000
two      2001
three    2000
four     2001
five     2000
six      2001
Name: year, dtype: int64

In [53]:
#attribute like
frame2.state

one        Ohio
two        Ohio
three    Nevada
four     Nevada
five      Japan
six       Japan
Name: state, dtype: object

In [54]:
# retrieves first row
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
Debt      NaN
Name: one, dtype: object

In [56]:
frame2.head()

       year   state  pop Debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2000  Nevada  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2000   Japan  2.9  NaN

In [65]:
#assigning values to the null coloumn debt
print(len(frame2))
rng=np.arange(6.0)
frame2['Debt']=rng
frame2

6

       year   state  pop  Debt  debt
one    2000    Ohio  1.5   0.0   0.0
two    2001    Ohio  1.7   1.0   1.0
three  2000  Nevada  3.6   2.0   2.0
four   2001  Nevada  2.4   3.0   3.0
five   2000   Japan  2.9   4.0   4.0
six    2001   Japan  3.2   5.0   5.0

In [66]:
#assigning values to the null coloumn debt
ln= len(frame2)
rng=np.arange(ln)
frame2['Debt']=rng
frame2

       year   state  pop  Debt  debt
one    2000    Ohio  1.5     0   0.0
two    2001    Ohio  1.7     1   1.0
three  2000  Nevada  3.6     2   2.0
four   2001  Nevada  2.4     3   3.0
five   2000   Japan  2.9     4   4.0
six    2001   Japan  3.2     5   5.0

In [69]:
val2=pd.Series([-1.2,-1.5,-1.7,-1.2,-1.5,-1.7],
              index=['one','two','three','four','five','six'])
frame2['Debt']=val2
frame2

       year   state  pop  Debt  debt
one    2000    Ohio  1.5  -1.2   0.0
two    2001    Ohio  1.7  -1.5   1.0
three  2000  Nevada  3.6  -1.7   2.0
four   2001  Nevada  2.4  -1.2   3.0
five   2000   Japan  2.9  -1.5   4.0
six    2001   Japan  3.2  -1.7   5.0

In [70]:
val2=pd.Series([-1.2,-1.5,-1.7,-1.2,-1.5,-1.7],
              index=['zero','two','three','four','five','six'])
frame2['Debt']=val2
frame2

       year   state  pop  Debt  debt
one    2000    Ohio  1.5   NaN   0.0
two    2001    Ohio  1.7  -1.5   1.0
three  2000  Nevada  3.6  -1.7   2.0
four   2001  Nevada  2.4  -1.2   3.0
five   2000   Japan  2.9  -1.5   4.0
six    2001   Japan  3.2  -1.7   5.0

In [71]:
frame2['Debt']=1.6
frame2

       year   state  pop  Debt  debt
one    2000    Ohio  1.5   1.6   0.0
two    2001    Ohio  1.7   1.6   1.0
three  2000  Nevada  3.6   1.6   2.0
four   2001  Nevada  2.4   1.6   3.0
five   2000   Japan  2.9   1.6   4.0
six    2001   Japan  3.2   1.6   5.0

# Functions Application and Mapping

In [7]:
import numpy as np
frame3=pd.DataFrame(np.random.randn(4,3),
                   columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])
print(frame3)
print(np.abs(frame3)) #sari -ve values hatadega

print(frame3["d"].min())
print(frame3["d"].max())
print(frame3["d"].max()-frame3["d"].min())

               b         d         e
Utah   -0.124050  2.125225 -0.489796
Ohio   -0.261702 -0.171524  1.225613
Texas   2.169708  1.401909  0.795893
Oregon -0.567987  0.215116  0.232480
               b         d         e
Utah    0.124050  2.125225  0.489796
Ohio    0.261702  0.171524  1.225613
Texas   2.169708  1.401909  0.795893
Oregon  0.567987  0.215116  0.232480
-0.1715243726854596
2.125224576185937
2.2967489488713966

In [12]:

f=lambda x:x.max()-x.min() #unnamed function f using lambda
df=frame3.apply(f) #frame3 pr apply krdo changes
print(df,type(df)) 
df=frame3.apply(f,axis=0)
print(df)

b    2.737695
d    2.296749
e    1.715408
dtype: float64 <class 'pandas.core.series.Series'>
b    2.737695
d    2.296749
e    1.715408
dtype: float64

In [9]:
def min_max(x):
    minimum=x.min()
    maximum=x.max()
    return pd.Series([x.min(),x.max()], index=['min','max'])

df=frame3.apply(min_max)
print(df,type(df))

            b         d         e
min -0.567987 -0.171524 -0.489796
max  2.169708  2.125225  1.225613 <class 'pandas.core.frame.DataFrame'>

In [16]:
#Sorting and Ranking
frame4=pd.DataFrame(np.arange(8).reshape((2,4)),
                   index=['three','one'],
                   columns=['d','a','b','c'])
print(frame4)
print()
print(frame4.sort_index(axis=1,ascending=False))
print()
print(frame4.sort_index())

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [20]:
#sort by values
print(frame4.sort_values(by='b'))
print(frame4.rank(ascending=False,method='max'))
print(frame4.rank(ascending=True,method='min'))
print(frame4.rank(axis='columns'))

       d  a  b  c
three  0  1  2  3
one    4  5  6  7
         d    a    b    c
three  2.0  2.0  2.0  2.0
one    1.0  1.0  1.0  1.0
         d    a    b    c
three  1.0  1.0  1.0  1.0
one    2.0  2.0  2.0  2.0
         d    a    b    c
three  1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0

# Aithmetic and Data Alignment

In [22]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)),
                columns=list('bcd'),
                index=['ohio','texas','colorado'])
df2=pd.DataFrame(np.arange(12.).reshape((4,3)),
                columns=list('bde'),
                index=['utha','ohio','texas','colorado'])
print(df1)
print()
print(df2)
print()

df3=df1+df2
print(df3)

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

            b     d     e
utha      0.0   1.0   2.0
ohio      3.0   4.0   5.0
texas     6.0   7.0   8.0
colorado  9.0  10.0  11.0

             b   c     d   e
colorado  15.0 NaN  18.0 NaN
ohio       3.0 NaN   6.0 NaN
texas      9.0 NaN  12.0 NaN
utha       NaN NaN   NaN NaN

In [24]:
df3=pd.DataFrame(np.arange(12.).reshape((3,4)),
                columns=list('abcd'))
df4=pd.DataFrame(np.arange(20.).reshape((4,5)),
                columns=list('abcde'))
print(df1)
print()
print(df2)
print()

df3=df1+df2
print(df3)

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

            b     d     e
utha      0.0   1.0   2.0
ohio      3.0   4.0   5.0
texas     6.0   7.0   8.0
colorado  9.0  10.0  11.0

             b   c     d   e
colorado  15.0 NaN  18.0 NaN
ohio       3.0 NaN   6.0 NaN
texas      9.0 NaN  12.0 NaN
utha       NaN NaN   NaN NaN

In [30]:
#DELETING DATA
df11=pd.DataFrame(np.arange(16).reshape((4,4)),
                columns=['one','two','three','four'],
                index=['ohio','texas','colorado','utah'])
print(df11)

          one  two  three  four
ohio        0    1      2     3
texas       4    5      6     7
colorado    8    9     10    11
utah       12   13     14    15

In [31]:
df11=df11.drop('two',axis=1)
print(df11)

          one  three  four
ohio        0      2     3
texas       4      6     7
colorado    8     10    11
utah       12     14    15

In [33]:
df11=df11.drop('colorado',axis=0) #axis 0 se row del hoti hy
print(df11)

       one  three  four
ohio     0      2     3
texas    4      6     7
utah    12     14    15

In [34]:
#Indexing Slicing and Filtering DATA
df12=pd.DataFrame(np.arange(16).reshape((4,4)),
                columns=['one','two','three','four'],
                index=['ohio','texas','colorado','utah'])
print(df12)

          one  two  three  four
ohio        0    1      2     3
texas       4    5      6     7
colorado    8    9     10    11
utah       12   13     14    15

In [35]:
df12[['one','two']]

          one  two
ohio        0    1
texas       4    5
colorado    8    9
utah       12   13

In [36]:
print(df12[2:])

          one  two  three  four
colorado    8    9     10    11
utah       12   13     14    15

In [37]:
print(df12[:2])

       one  two  three  four
ohio     0    1      2     3
texas    4    5      6     7

In [41]:
#conditional selection
print(df12[df12['three']>2])

          one  two  three  four
texas       4    5      6     7
colorado    8    9     10    11
utah       12   13     14    15

# reindex Method

In [45]:
import pandas as pd
obj3=pd.Series(['blue','purple','yellow'],index=[0,3,6])
print(obj3)
print()
obj3=obj3.reindex(range(9))
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1       NaN
2       NaN
3    purple
4       NaN
5       NaN
6    yellow
7       NaN
8       NaN
dtype: object

In [47]:
import pandas as pd
obj3=pd.Series(['blue','purple','yellow'],index=[0,3,6])
print(obj3)
print()
obj3=obj3.reindex(range(9),method='ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [48]:
import pandas as pd
obj3=pd.Series(['blue','purple','yellow'],index=[0,3,6])
print(obj3)
print()
obj3=obj3.reindex(range(2,11))
obj3

0      blue
3    purple
6    yellow
dtype: object

2        NaN
3     purple
4        NaN
5        NaN
6     yellow
7        NaN
8        NaN
9        NaN
10       NaN
dtype: object

In [49]:
import pandas as pd
obj3=pd.Series(['blue','purple','yellow'],index=[0,3,6])
print(obj3)
print()
obj3=obj3.reindex(range(2,11),method='ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
dtype: object

In [59]:
test=pd.DataFrame(np.arange(9).reshape((3,3)),
                 index=['a','b','c'],
                 columns=['ohio','utah','california'])
print(test)
print()
states=['ohio','texas','utah','california']
# test=test.reindex(columns=states,method='cfill')
# print(test)

   ohio  utah  california
a     0     1           2
b     3     4           5
c     6     7           8

ValueError: Invalid fill method. Expecting pad (ffill), backfill (bfill) or nearest. Got cfill

# Data Loading,Storage, and File Formats

In [ ]:
#excel and csv store data in text form